In [1]:
import pandas as pd

In [2]:
df_credit = pd.read_csv('https://www.littledataman.com/samples/credit.csv', parse_dates = ['Approval Date'])
df_cards = pd.read_csv('https://www.littledataman.com/samples/cards.csv', parse_dates = ['Effective Date'])
df_transactions = pd.read_csv('https://www.littledataman.com/samples/transactions.csv', parse_dates = ['Date'])

In [3]:
df_credit

,First Name,Last Name,Credit Score,Credit Approval,Card Name,Income,Approval Date
0,Jacky,White,825,True,Infinite,155000.62,2019-09-13 12:00:00
1,Jane,Nize,810,True,Golden,120800.88,2019-08-16 05:25:00
2,Henry,Tone,780,True,Golden,98000.58,2020-05-06 12:00:00
3,Desmond,Black,750,True,Silver,54000.00,2020-05-01 01:00:00
4,Eileen,Musk,620,False,Dividend,35000.00,NaT

In [4]:
df_credit['Audited'] = True

In [5]:
df_credit

,First Name,Last Name,Credit Score,Credit Approval,Card Name,Income,Approval Date,Audited
0,Jacky,White,825,True,Infinite,155000.62,2019-09-13 12:00:00,True
1,Jane,Nize,810,True,Golden,120800.88,2019-08-16 05:25:00,True
2,Henry,Tone,780,True,Golden,98000.58,2020-05-06 12:00:00,True
3,Desmond,Black,750,True,Silver,54000.00,2020-05-01 01:00:00,True
4,Eileen,Musk,620,False,Dividend,35000.00,NaT,True

In [6]:
df_credit['Full Name'] = df_credit['First Name'] + ' ' + df_credit['Last Name']
df_credit

,First Name,Last Name,Credit Score,Credit Approval,Card Name,Income,Approval Date,Audited,Full Name
0,Jacky,White,825,True,Infinite,155000.62,2019-09-13 12:00:00,True,Jacky White
1,Jane,Nize,810,True,Golden,120800.88,2019-08-16 05:25:00,True,Jane Nize
2,Henry,Tone,780,True,Golden,98000.58,2020-05-06 12:00:00,True,Henry Tone
3,Desmond,Black,750,True,Silver,54000.00,2020-05-01 01:00:00,True,Desmond Black
4,Eileen,Musk,620,False,Dividend,35000.00,NaT,True,Eileen Musk

In [8]:
df = df_credit.assign(Full_Name = df_credit['Last Name'] + ', ' + df_credit['First Name'] )
df

,First Name,Last Name,Credit Score,Credit Approval,Card Name,Income,Approval Date,Audited,Full Name,Full_Name
0,Jacky,White,825,True,Infinite,155000.62,2019-09-13 12:00:00,True,Jacky White,"White, Jacky"
1,Jane,Nize,810,True,Golden,120800.88,2019-08-16 05:25:00,True,Jane Nize,"Nize, Jane"
2,Henry,Tone,780,True,Golden,98000.58,2020-05-06 12:00:00,True,Henry Tone,"Tone, Henry"
3,Desmond,Black,750,True,Silver,54000.00,2020-05-01 01:00:00,True,Desmond Black,"Black, Desmond"
4,Eileen,Musk,620,False,Dividend,35000.00,NaT,True,Eileen Musk,"Musk, Eileen"

In [9]:
df.rename(columns={'First Name':'Fist'}, inplace=True)
df

,Fist,Last Name,Credit Score,Credit Approval,Card Name,Income,Approval Date,Audited,Full Name,Full_Name
0,Jacky,White,825,True,Infinite,155000.62,2019-09-13 12:00:00,True,Jacky White,"White, Jacky"
1,Jane,Nize,810,True,Golden,120800.88,2019-08-16 05:25:00,True,Jane Nize,"Nize, Jane"
2,Henry,Tone,780,True,Golden,98000.58,2020-05-06 12:00:00,True,Henry Tone,"Tone, Henry"
3,Desmond,Black,750,True,Silver,54000.00,2020-05-01 01:00:00,True,Desmond Black,"Black, Desmond"
4,Eileen,Musk,620,False,Dividend,35000.00,NaT,True,Eileen Musk,"Musk, Eileen"

In [10]:
df_credit = df_credit.append({'First Name': 'John', 'Last Name': 'Abuli','Credit Score':785}, ignore_index=True)
df_credit

,First Name,Last Name,Credit Score,Credit Approval,Card Name,Income,Approval Date,Audited,Full Name
0,Jacky,White,825,1.0,Infinite,155000.62,2019-09-13 12:00:00,1.0,Jacky White
1,Jane,Nize,810,1.0,Golden,120800.88,2019-08-16 05:25:00,1.0,Jane Nize
2,Henry,Tone,780,1.0,Golden,98000.58,2020-05-06 12:00:00,1.0,Henry Tone
3,Desmond,Black,750,1.0,Silver,54000.00,2020-05-01 01:00:00,1.0,Desmond Black
4,Eileen,Musk,620,0.0,Dividend,35000.00,NaT,1.0,Eileen Musk
5,John,Abuli,785,NaN,NaN,NaN,NaT,NaN,NaN

In [19]:
df = df_credit.set_index('Credit Score')
df.loc[825] = ['Johnny', 'Haw','','','','','','' ]
df

,First Name,Last Name,Credit Approval,Card Name,Income,Approval Date,Audited,Full Name
Credit Score,,,,,,,,
825,Johnny,Haw,,,,,,
810,Jane,Nize,1,Golden,120801,2019-08-16 05:25:00,1,Jane Nize
780,Henry,Tone,1,Golden,98000.6,2020-05-06 12:00:00,1,Henry Tone
750,Desmond,Black,1,Silver,54000,2020-05-01 01:00:00,1,Desmond Black
620,Eileen,Musk,0,Dividend,35000,NaT,1,Eileen Musk
785,John,Abuli,NaN,NaN,NaN,NaT,NaN,NaN

In [20]:
df_credit.drop([0, 3])

,First Name,Last Name,Credit Score,Credit Approval,Card Name,Income,Approval Date,Audited,Full Name
1,Jane,Nize,810,1.0,Golden,120800.88,2019-08-16 05:25:00,1.0,Jane Nize
2,Henry,Tone,780,1.0,Golden,98000.58,2020-05-06 12:00:00,1.0,Henry Tone
4,Eileen,Musk,620,0.0,Dividend,35000.00,NaT,1.0,Eileen Musk
5,John,Abuli,785,NaN,NaN,NaN,NaT,NaN,NaN

In [22]:
row_index = df_credit[(df_credit['Credit Approval'] == False)|(df_credit['Credit Score']<780)].index
row_index

Int64Index([3, 4], dtype='int64')

In [23]:
df_credit.drop(['Credit Approval', 'Card Name'], axis = 1)

,First Name,Last Name,Credit Score,Income,Approval Date,Audited,Full Name
0,Jacky,White,825,155000.62,2019-09-13 12:00:00,1.0,Jacky White
1,Jane,Nize,810,120800.88,2019-08-16 05:25:00,1.0,Jane Nize
2,Henry,Tone,780,98000.58,2020-05-06 12:00:00,1.0,Henry Tone
3,Desmond,Black,750,54000.00,2020-05-01 01:00:00,1.0,Desmond Black
4,Eileen,Musk,620,35000.00,NaT,1.0,Eileen Musk
5,John,Abuli,785,NaN,NaT,NaN,NaN

In [24]:
df_credit.drop([df_credit.columns[2], df_credit.columns[3]], axis = 1)

,First Name,Last Name,Card Name,Income,Approval Date,Audited,Full Name
0,Jacky,White,Infinite,155000.62,2019-09-13 12:00:00,1.0,Jacky White
1,Jane,Nize,Golden,120800.88,2019-08-16 05:25:00,1.0,Jane Nize
2,Henry,Tone,Golden,98000.58,2020-05-06 12:00:00,1.0,Henry Tone
3,Desmond,Black,Silver,54000.00,2020-05-01 01:00:00,1.0,Desmond Black
4,Eileen,Musk,Dividend,35000.00,NaT,1.0,Eileen Musk
5,John,Abuli,NaN,NaN,NaT,NaN,NaN

In [25]:
df_credit.loc[df_credit['Credit Score'] > 800, 'Segment' ] = 'Excellent'
df_credit

,First Name,Last Name,Credit Score,Credit Approval,Card Name,Income,Approval Date,Audited,Full Name,Segment
0,Jacky,White,825,1.0,Infinite,155000.62,2019-09-13 12:00:00,1.0,Jacky White,Excellent
1,Jane,Nize,810,1.0,Golden,120800.88,2019-08-16 05:25:00,1.0,Jane Nize,Excellent
2,Henry,Tone,780,1.0,Golden,98000.58,2020-05-06 12:00:00,1.0,Henry Tone,NaN
3,Desmond,Black,750,1.0,Silver,54000.00,2020-05-01 01:00:00,1.0,Desmond Black,NaN
4,Eileen,Musk,620,0.0,Dividend,35000.00,NaT,1.0,Eileen Musk,NaN
5,John,Abuli,785,NaN,NaN,NaN,NaT,NaN,NaN,NaN

In [26]:
df_credit.loc[df_credit['Credit Score'] < 700, 'Segment' ] = 'Poor'
df_credit

,First Name,Last Name,Credit Score,Credit Approval,Card Name,Income,Approval Date,Audited,Full Name,Segment
0,Jacky,White,825,1.0,Infinite,155000.62,2019-09-13 12:00:00,1.0,Jacky White,Excellent
1,Jane,Nize,810,1.0,Golden,120800.88,2019-08-16 05:25:00,1.0,Jane Nize,Excellent
2,Henry,Tone,780,1.0,Golden,98000.58,2020-05-06 12:00:00,1.0,Henry Tone,NaN
3,Desmond,Black,750,1.0,Silver,54000.00,2020-05-01 01:00:00,1.0,Desmond Black,NaN
4,Eileen,Musk,620,0.0,Dividend,35000.00,NaT,1.0,Eileen Musk,Poor
5,John,Abuli,785,NaN,NaN,NaN,NaT,NaN,NaN,NaN

In [27]:
df_credit.loc[(df_credit['Credit Score'] <= 800) & (df_credit['Income']> 80000), 'Segment' ] = 'Advanced'
df_credit

,First Name,Last Name,Credit Score,Credit Approval,Card Name,Income,Approval Date,Audited,Full Name,Segment
0,Jacky,White,825,1.0,Infinite,155000.62,2019-09-13 12:00:00,1.0,Jacky White,Excellent
1,Jane,Nize,810,1.0,Golden,120800.88,2019-08-16 05:25:00,1.0,Jane Nize,Excellent
2,Henry,Tone,780,1.0,Golden,98000.58,2020-05-06 12:00:00,1.0,Henry Tone,Advanced
3,Desmond,Black,750,1.0,Silver,54000.00,2020-05-01 01:00:00,1.0,Desmond Black,NaN
4,Eileen,Musk,620,0.0,Dividend,35000.00,NaT,1.0,Eileen Musk,Poor
5,John,Abuli,785,NaN,NaN,NaN,NaT,NaN,NaN,NaN

In [29]:
df_credit.iloc[4,3] = True
df_credit

,First Name,Last Name,Credit Score,Credit Approval,Card Name,Income,Approval Date,Audited,Full Name,Segment
0,Jacky,White,825,1,Infinite,155000.62,2019-09-13 12:00:00,1.0,Jacky White,Excellent
1,Jane,Nize,810,1,Golden,120800.88,2019-08-16 05:25:00,1.0,Jane Nize,Excellent
2,Henry,Tone,780,1,Golden,98000.58,2020-05-06 12:00:00,1.0,Henry Tone,Advanced
3,Desmond,Black,750,1,Silver,54000.00,2020-05-01 01:00:00,1.0,Desmond Black,NaN
4,Eileen,Musk,620,True,Dividend,35000.00,NaT,1.0,Eileen Musk,Poor
5,John,Abuli,785,NaN,NaN,NaN,NaT,NaN,NaN,NaN

In [31]:
df_credit

,First Name,Last Name,Credit Score,Credit Approval,Card Name,Income,Approval Date,Audited,Full Name,Segment
0,Jacky,White,825,1,Infinite,155000.62,2019-09-13 12:00:00,1.0,Jacky White,Excellent
1,Jane,Nize,810,1,Golden,120800.88,2019-08-16 05:25:00,1.0,Jane Nize,Excellent
2,Henry,Tone,780,1,Golden,98000.58,2020-05-06 12:00:00,1.0,Henry Tone,Advanced
3,Desmond,Black,750,1,Silver,54000.00,2020-05-01 01:00:00,1.0,Desmond Black,NaN
4,Eileen,Musk,620,True,Dividend,35000.00,NaT,1.0,Eileen Musk,Poor
5,John,Abuli,785,NaN,NaN,NaN,NaT,NaN,NaN,NaN

In [32]:
df_credit['Income'] = df_credit['Income'].mask( df_credit['Income'] > 100000, 100000 )
df_credit

,First Name,Last Name,Credit Score,Credit Approval,Card Name,Income,Approval Date,Audited,Full Name,Segment
0,Jacky,White,825,1,Infinite,100000.00,2019-09-13 12:00:00,1.0,Jacky White,Excellent
1,Jane,Nize,810,1,Golden,100000.00,2019-08-16 05:25:00,1.0,Jane Nize,Excellent
2,Henry,Tone,780,1,Golden,98000.58,2020-05-06 12:00:00,1.0,Henry Tone,Advanced
3,Desmond,Black,750,1,Silver,54000.00,2020-05-01 01:00:00,1.0,Desmond Black,NaN
4,Eileen,Musk,620,True,Dividend,35000.00,NaT,1.0,Eileen Musk,Poor
5,John,Abuli,785,NaN,NaN,NaN,NaT,NaN,NaN,NaN

In [34]:
df_credit.mask( df_credit.isna(),'Not Approved' )

,First Name,Last Name,Credit Score,Credit Approval,Card Name,Income,Approval Date,Audited,Full Name,Segment
0,Jacky,White,825,1,Infinite,100000,2019-09-13 12:00:00,1,Jacky White,Excellent
1,Jane,Nize,810,1,Golden,100000,2019-08-16 05:25:00,1,Jane Nize,Excellent
2,Henry,Tone,780,1,Golden,98000.6,2020-05-06 12:00:00,1,Henry Tone,Advanced
3,Desmond,Black,750,1,Silver,54000,2020-05-01 01:00:00,1,Desmond Black,Not Approved
4,Eileen,Musk,620,True,Dividend,35000,Not Approved,1,Eileen Musk,Poor
5,John,Abuli,785,Not Approved,Not Approved,Not Approved,Not Approved,Not Approved,Not Approved,Not Approved

In [35]:
df_credit

,First Name,Last Name,Credit Score,Credit Approval,Card Name,Income,Approval Date,Audited,Full Name,Segment
0,Jacky,White,825,1,Infinite,100000.00,2019-09-13 12:00:00,1.0,Jacky White,Excellent
1,Jane,Nize,810,1,Golden,100000.00,2019-08-16 05:25:00,1.0,Jane Nize,Excellent
2,Henry,Tone,780,1,Golden,98000.58,2020-05-06 12:00:00,1.0,Henry Tone,Advanced
3,Desmond,Black,750,1,Silver,54000.00,2020-05-01 01:00:00,1.0,Desmond Black,NaN
4,Eileen,Musk,620,True,Dividend,35000.00,NaT,1.0,Eileen Musk,Poor
5,John,Abuli,785,NaN,NaN,NaN,NaT,NaN,NaN,NaN

In [36]:
import numpy as np
df_credit['log_Income'] = np.log(df_credit['Income'])
df_credit

,First Name,Last Name,Credit Score,Credit Approval,Card Name,Income,Approval Date,Audited,Full Name,Segment,log_Income
0,Jacky,White,825,1,Infinite,100000.00,2019-09-13 12:00:00,1.0,Jacky White,Excellent,11.512925
1,Jane,Nize,810,1,Golden,100000.00,2019-08-16 05:25:00,1.0,Jane Nize,Excellent,11.512925
2,Henry,Tone,780,1,Golden,98000.58,2020-05-06 12:00:00,1.0,Henry Tone,Advanced,11.492729
3,Desmond,Black,750,1,Silver,54000.00,2020-05-01 01:00:00,1.0,Desmond Black,NaN,10.896739
4,Eileen,Musk,620,True,Dividend,35000.00,NaT,1.0,Eileen Musk,Poor,10.463103
5,John,Abuli,785,NaN,NaN,NaN,NaT,NaN,NaN,NaN,NaN

In [37]:
df_credit['First_Find Ja'] = df_credit['First Name'].str.find('Ja')
df_credit

,First Name,Last Name,Credit Score,Credit Approval,Card Name,Income,Approval Date,Audited,Full Name,Segment,log_Income,First_Find Ja
0,Jacky,White,825,1,Infinite,100000.00,2019-09-13 12:00:00,1.0,Jacky White,Excellent,11.512925,0
1,Jane,Nize,810,1,Golden,100000.00,2019-08-16 05:25:00,1.0,Jane Nize,Excellent,11.512925,0
2,Henry,Tone,780,1,Golden,98000.58,2020-05-06 12:00:00,1.0,Henry Tone,Advanced,11.492729,-1
3,Desmond,Black,750,1,Silver,54000.00,2020-05-01 01:00:00,1.0,Desmond Black,NaN,10.896739,-1
4,Eileen,Musk,620,True,Dividend,35000.00,NaT,1.0,Eileen Musk,Poor,10.463103,-1
5,John,Abuli,785,NaN,NaN,NaN,NaT,NaN,NaN,NaN,NaN,-1

In [38]:
pd.to_datetime(['2020-06-05', '6/6/2020', 'June 7,2020', '2020-06-15 12:20pm'])

DatetimeIndex(['2020-06-05 00:00:00', '2020-06-06 00:00:00',
               '2020-06-07 00:00:00', '2020-06-15 12:20:00'],
              dtype='datetime64[ns]', freq=None)